In [1]:
import pandas as pd
india_weather=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
    "humidity":[80,60,78]
})
india_weather

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

In [2]:
us_weather=pd.DataFrame({
    "city":["new york","chicago","orlando"],
    "temperature":[21,14,54],
    "humidity":[60,65,75]
})
us_weather

       city  temperature  humidity
0  new york           21        60
1   chicago           14        65
2   orlando           54        75

In [3]:
df=pd.concat([india_weather,us_weather])
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
0   new york           21        60
1    chicago           14        65
2    orlando           54        75

In [5]:
df=pd.concat([india_weather,us_weather],ignore_index=True)
df

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78
3   new york           21        60
4    chicago           14        65
5    orlando           54        75

In [7]:
df=pd.concat([india_weather,us_weather],keys=["india","us"])
df

              city  temperature  humidity
india 0     mumbai           32        80
      1      delhi           45        60
      2  bangalore           30        78
us    0   new york           21        60
      1    chicago           14        65
      2    orlando           54        75

In [8]:
df.loc["india"]

        city  temperature  humidity
0     mumbai           32        80
1      delhi           45        60
2  bangalore           30        78

# Appending 2 dataframes (column-wise)

In [9]:
temperature_df=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [10]:
windspeed_df=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "windspeed":[7,45,78]
})
windspeed_df

        city  windspeed
0     mumbai          7
1      delhi         45
2  bangalore         78

In [11]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

        city  temperature       city  windspeed
0     mumbai           32     mumbai          7
1      delhi           45      delhi         45
2  bangalore           30  bangalore         78

# Concatenation Using Index

In [12]:
temperature_df=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [13]:
windspeed_df=pd.DataFrame({
    "city" : ["delhi","mumbai"],
    "windspeed":[45,78]
})
windspeed_df

     city  windspeed
0   delhi         45
1  mumbai         78

In [14]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

        city  temperature    city  windspeed
0     mumbai           32   delhi       45.0
1      delhi           45  mumbai       78.0
2  bangalore           30     NaN        NaN

In [15]:
temperature_df=pd.DataFrame({
    "city":["mumbai","delhi","bangalore"],
    "temperature":[32,45,30],
},index=[0,1,2])
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [16]:
windspeed_df=pd.DataFrame({
    "city" : ["delhi","mumbai"],
    "windspeed":[45,78]
}, index=[1,0])
windspeed_df

     city  windspeed
1   delhi         45
0  mumbai         78

In [17]:
df=pd.concat([temperature_df,windspeed_df],axis=1)
df

        city  temperature    city  windspeed
0     mumbai           32  mumbai       78.0
1      delhi           45   delhi       45.0
2  bangalore           30     NaN        NaN

# Creating series and appending to dataframe

In [18]:
temperature_df

        city  temperature
0     mumbai           32
1      delhi           45
2  bangalore           30

In [19]:
s = pd.Series(["humid","dry","rain"], name="event")
s

0    humid
1      dry
2     rain
Name: event, dtype: object

In [23]:
df = pd.concat([temperature_df,s], axis=1)
df

        city  temperature  event
0     mumbai           32  humid
1      delhi           45    dry
2  bangalore           30   rain